<a href="https://colab.research.google.com/github/iampramodyadav/SQL/blob/main/3_2_SQL_Hands_on_Lab(IBM_Coursera).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
!wget --header="Host: doc-0s-6c-sheets.googleusercontent.com" --header="User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.114 Safari/537.36" --header="Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9" --header="Accept-Language: en-US,en;q=0.9" --header="Referer: https://docs.google.com/" "https://doc-0s-6c-sheets.googleusercontent.com/export/u7offqfa6c5ebcqq1gheaur6fs/uvcbe137k0677u51ga2oro6q34/1625003265000/111118528152204709033/111118528152204709033/1r_wWruAhacMNbnFhI7I_x7yC7bW6GM81lRJVDr6Pdso?format=csv&id=1r_wWruAhacMNbnFhI7I_x7yC7bW6GM81lRJVDr6Pdso&gid=0&dat=AFCstmpDD_wNbmGV3P-q9eCzYw_3ytafaYicpRlLG-rFuJZybu_JCqDQfesRtiuOReIPB-2_6jIW6wdhNMVvsG4GUxY0d7z6BhlVH3XJN_4SwaGDXyR9YqsRCWcD3yAoRuUfshbNMVFjNwb0WlvlvgF2Np4c_6U46NZJfaUAp87N-gX-W6gmByqYb_2beXbLUAyev2cVpswW0LagU6GUFHqbp9TZ7P85R7SHtu2daUhb4EgTSu8o3SllaEoAIETPe5n1-GvSzyy_pOo8toLVtR-vompy7RwROCEdA0xh96PwG6OsKGtDWf9oLwdMly5P43TGxpvMPZL331Ifo8xglsTZY46JFkvn3pHIebrr7ZvWm46DTPq6HhiYYD59BQKzHaibFl1RktJcspqc2z0O55a2bH8GiwtQpLmhsOMM33-9k5vh9iljv99KKZywxHTsx5qQI3PMRqvxL2yYOl48oPq3kOP9KucT0Y3sdSFdvl9kOGiecEoUulNnKkImc6yXY_yYIQUM8-1jbQCBGDEScBDlagz-h0cGdy1m0NqDN-Dj3ck6XA-DbhbJb55VsUVmJXw6rfiawMcJPrCElCjes6utdnfgEcgFzcY62zjRurLrMLHh9wcTp0ACuLuUu32BwYvzJjJWggA9rgMgd-gt71QndIFSxEhOivwKuc9CErri92BC7EZUGdggrU9URT4_Adixejsa9TEEPh7FueIW98PUH0BlSJ0" -c -O 'Untitled spreadsheet - Sheet1.csv'

--2021-06-29 21:54:06--  https://doc-0s-6c-sheets.googleusercontent.com/export/u7offqfa6c5ebcqq1gheaur6fs/uvcbe137k0677u51ga2oro6q34/1625003265000/111118528152204709033/111118528152204709033/1r_wWruAhacMNbnFhI7I_x7yC7bW6GM81lRJVDr6Pdso?format=csv&id=1r_wWruAhacMNbnFhI7I_x7yC7bW6GM81lRJVDr6Pdso&gid=0&dat=AFCstmpDD_wNbmGV3P-q9eCzYw_3ytafaYicpRlLG-rFuJZybu_JCqDQfesRtiuOReIPB-2_6jIW6wdhNMVvsG4GUxY0d7z6BhlVH3XJN_4SwaGDXyR9YqsRCWcD3yAoRuUfshbNMVFjNwb0WlvlvgF2Np4c_6U46NZJfaUAp87N-gX-W6gmByqYb_2beXbLUAyev2cVpswW0LagU6GUFHqbp9TZ7P85R7SHtu2daUhb4EgTSu8o3SllaEoAIETPe5n1-GvSzyy_pOo8toLVtR-vompy7RwROCEdA0xh96PwG6OsKGtDWf9oLwdMly5P43TGxpvMPZL331Ifo8xglsTZY46JFkvn3pHIebrr7ZvWm46DTPq6HhiYYD59BQKzHaibFl1RktJcspqc2z0O55a2bH8GiwtQpLmhsOMM33-9k5vh9iljv99KKZywxHTsx5qQI3PMRqvxL2yYOl48oPq3kOP9KucT0Y3sdSFdvl9kOGiecEoUulNnKkImc6yXY_yYIQUM8-1jbQCBGDEScBDlagz-h0cGdy1m0NqDN-Dj3ck6XA-DbhbJb55VsUVmJXw6rfiawMcJPrCElCjes6utdnfgEcgFzcY62zjRurLrMLHh9wcTp0ACuLuUu32BwYvzJjJWggA9rgMgd-gt71QndIFSxEhOivwKuc9CErri92BC7EZUGdggrU9URT4_Adixejsa9TEEPh7FueIW98PUH0BlSJ0
Resolving doc-0s-6c-sheets.googleusercontent.com (doc-0s-6c-sheets.googleusercontent.com)... 142.250.157.132, 2404:6800:4008:c13::84
Connecting to doc-0s-6c-sheets.googleusercontent.com (doc-0s-6c-sheets.googleusercontent.com)|142.250.157.132|:443... connected.
HTTP request sent, awaiting response... 400 Bad Request
2021-06-29 21:54:07 ERROR 400: Bad Request.

In [10]:
import pandas as pd


from sqlalchemy import create_engine

In [ ]:
Instructor=pd.read_csv("Instructor.csv")

In [3]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [8]:
PETRESCUE=pd.read_csv('/content/drive/MyDrive/dataset/dataset.csv')

In [13]:
PETRESCUE.head()

   ID  ANIMAL  QUANTITY    COST  RESCUEDATE
0   1     Cat         9  450.09  2018-05-29
1   2     Dog         3  666.66  2018-06-01
2   3     Dog         1  100.00  2018-06-04
3   4  Parrot         2   50.00  2018-06-04
4   5     Dog         1   75.75  2018-06-10

In [15]:
PETRESCUE=PETRESCUE.set_index('ID')

In [16]:
PETRESCUE.head()

    ANIMAL  QUANTITY    COST  RESCUEDATE
ID
1      Cat         9  450.09  2018-05-29
2      Dog         3  666.66  2018-06-01
3      Dog         1  100.00  2018-06-04
4   Parrot         2   50.00  2018-06-04
5      Dog         1   75.75  2018-06-10

In [18]:
temp_db = create_engine('sqlite:///:memory:')
PETRESCUE.to_sql(name='PETRESCUE',con=temp_db)

In [19]:
pd.read_sql(sql='PETRESCUE',con=temp_db)

   ID    ANIMAL  QUANTITY    COST  RESCUEDATE
0   1       Cat         9  450.09  2018-05-29
1   2       Dog         3  666.66  2018-06-01
2   3       Dog         1  100.00  2018-06-04
3   4    Parrot         2   50.00  2018-06-04
4   5       Dog         1   75.75  2018-06-10
5   6   Hamster         6   60.60  2018-06-11
6   7       Cat         1   44.44  2018-06-11
7   8  Goldfish        24   48.48  2018-06-14

In [20]:
pd.read_sql_query(sql="""SELECT *  FROM PETRESCUE""",con=temp_db)

   ID    ANIMAL  QUANTITY    COST  RESCUEDATE
0   1       Cat         9  450.09  2018-05-29
1   2       Dog         3  666.66  2018-06-01
2   3       Dog         1  100.00  2018-06-04
3   4    Parrot         2   50.00  2018-06-04
4   5       Dog         1   75.75  2018-06-10
5   6   Hamster         6   60.60  2018-06-11
6   7       Cat         1   44.44  2018-06-11
7   8  Goldfish        24   48.48  2018-06-14